normal_frame_6x9 = {
    "top": "┏━━━━━━━━━┓",
    "mid": "┃{0}┃",
"bottom":  "┗━━━━━━━━━┛"};

holo_frame_6x9 = {
    "top": "┏━★★★★★━┓",
    "mid": "┃{0}┃",
"bottom":  "┗━★★★★★━┛"};

class CardDatabase:
    def __init__(self):
        self.special_cards = {}

    def generate_cards_database(self):
        """Generate all 151 cards with their stats and ASCII art"""
        cards = {}

        self.cards = {
            "common": {
                "ph": {
                    art: {
                    }
                },

            },
            "uncommon": {
                "ph": {
                    art: {
                        1: "         ", 
                        2: "         ", 
                        3: "         ", 
                        4: "         ", 
                        5: "         ", 
                        6: "         "
                    }
                },
            },
            "rare": {
                "Imperial Imp": {
                    art: {
                        1: " \ ═╬═ /  ", 
                        2: " |  ║  | ", 
                        3: "( ☼╲ ╱☼ )", 
                        4: " \  ▼  / ", 
                        5: "  \___/  ", 
                        6: " /    '\ "
                    },
                }, 
            },
            "mythic": {
                "League Start with the Boys": {
                    art: {
                        1: "   [POE] ", 
                        2: "  __=== o", 
                        3: " Zz|   | ", 
                        4: "zZ       ",
                        5: "|_o>-<  _",  
                        6: "|--tom--|",
                    }
                },
                "Fabled Fortune": {
                    art: {
                        1: "  * ____ ", 
                        2: "  '|    |", 
                        3: "\* |____|", 
                        4: "' /$$$$/|", 
                        5: "-/____/ /", 
                        6: " |____|/ "
                    }
                },
                "Perfect Phoenix": {
                    art: {
                        1: "         ", 
                        2: "         ", 
                        3: "         ", 
                        4: "         ", 
                        5: "         ", 
                        6: "         "
                    }
                },
                "Ultimate Unicorn": {
                    art: {
                        1: "         ", 
                        2: "         ", 
                        3: "         ", 
                        4: "         ", 
                        5: "         ", 
                        6: "         "
                    }
                },
                "Supreme Shekel": {
                    art: {
                        1: "         ", 
                        2: "         ", 
                        3: "         ", 
                        4: "         ", 
                        5: "         ", 
                        6: "         "
                    }
                },
                "Celestial Coin": {
                    art: {
                        1: "         ", 
                        2: "         ", 
                        3: "         ", 
                        4: "         ", 
                        5: "         ", 
                        6: "         "
                    }
                },
                "Divine Dollar": {
                    art: {
                        1: "         ", 
                        2: "         ", 
                        3: "         ", 
                        4: "         ", 
                        5: "         ", 
                        6: "         "
                    }
                },
                "Legendary Shekel Lord": {
                    art: {
                        1: "         ", 
                        2: "         ", 
                        3: "         ", 
                        4: "         ", 
                        5: "         ", 
                        6: "         "
                    }
                },
                "Untainted Troll": {
                    art: {
                        1: "         ", 
                        2: "         ", 
                        3: "         ", 
                        4: "         ", 
                        5: "         ", 
                        6: "         "
                    }
                },
                "Heeeyyy fellaaaas": {
                    art: {
                        1: "         ", 
                        2: "         ", 
                        3: "         ", 
                        4: "         ", 
                        5: "         ", 
                        6: "         "
                    }
                },
                "Max Max Mangles": {
                    art: {
                        1: "         ", 
                        2: "         ", 
                        3: "         ", 
                        4: "         ", 
                        5: "         ", 
                        6: "         "
                    }
                },
                "Never Lucky": {
                    art: {
                        1: "         ", 
                        2: "         ", 
                        3: "         ", 
                        4: "         ", 
                        5: "         ", 
                        6: "         "
                    }
                },
                "Dave's Premature Refund": {
                    art: {
                        1: "         ", 
                        2: "         ", 
                        3: "         ", 
                        4: "         ", 
                        5: "         ", 
                        6: "         "
                    }
                },
                "250k bonus": {
                    art: {
                        1: "         ", 
                        2: "         ", 
                        3: "         ", 
                        4: "         ", 
                        5: "         ", 
                        6: "         "
                    }
                },
                "Immaculate Imp": {
                    art: {
                        1: "  / ║ \  ", 
                        2: " / ═╬═ \ ", 
                        3: "( ☼╲ ╱☼ )", 
                        4: " \ ◄▬► / ", 
                        5: "  \___/  ", 
                        6: " /    '\ "
                    },
                },
                "Impeccable Imp": {
                    art: {
                        1: "  / ║ \  ", 
                        2: " / ═╬═ \ ", 
                        3: "( ☼╲ ╱☼ )", 
                        4: " \ ▼▾▼  / ", 
                        5: "  \___/  ", 
                        6: " /    '\ "
                    },
                },
                "Chris in a Calculator": {
                    art: {
                        1: "   +1    ", 
                        2: " [ CHRIS]", 
                        3: " [][][][]", 
                        4: " [][][][]", 
                        5: " [][][][]", 
                        6: "         "
                    }
                },
                "I buy experiences!": {
                    art: {
                        1: "    I    ", 
                        2: "( ಠ ͜ʖ ರೃ)", 
                        3: "   BUY   ", 
                        4: "( ಠ ͜ʖ ರೃ)", 
                        5: "EXPER    ", 
                        6: "   IENCES"
                    },
                },
                "Daves 'Guild'": {
                    art: {
                        1: "  )  )   ", 
                        2: "\       /", 
                        3: " ∋)╭╮(∈  ", 
                        4: "_∋)╰╯(∈_/", 
                        5: "  /*\   |", 
                        6: " /╰╧╯\  |"
                    },
                },
                "TomSmells": {
                    art: {
                        1: " Tom    ~", 
                        2: "Smells ~ ", 
                        3: "   ()  ~ ", 
                        4: "  /||\  ~", 
                        5: "   /\ ╭∩╮", 
                        6: "     ╭ʖ╮ "
                    },
                },
                "Divine Orb": {
                    art: {
                        1: "$$  ____*", 
                        2: "  */u  u|", 
                        3: " /  ▲ * |", 
                        4: "*| --  / ", 
                        5: " \____/ *", 
                        6: "    *  $$"
                    },
                },
                "Top 100 Nestor": {
                    art: {
                        1: " Top 100 ", 
                        2: "♨(ಠ_ಠ)m ", 
                        3: "    _____", 
                        4: ".--/ ϭ  /", 
                        5: " \/____/ ", 
                        6: "         "
                    },
                },
                "Want it and Not Want it": {
                    art: {
                        1: "▓MEH▓/  /", 
                        2: "▓▓▓▓/  /░", 
                        3: "▓▓▓/  /░░", 
                        4: "▓▓/  /░░░", 
                        5: "▓/  /░░░░", 
                        6: "/  /░PLS░"
                    },
                },
                "The One True Liberal": {
                    art: {
                        1: "!?!?!?!/ ", 
                        2: "  (  )/  ", 
                        3: " /|   |  ", 
                        4: "/ | ==[++", 
                        5: "  | ) )  ", 
                        6: " / / \ \ "
                    },
                },
                "Ascended Shitty Wizard": {
                    art: {
                        1: "  /\     ", 
                        2: "_/  \_   ", 
                        3: "(-━ᶗ━) * ", 
                        4: " /**\╭/  ", 
                        5: "/****\  ~", 
                        6: " |  | ╭∩╮"
                    },
                },
            },
            "legendary": {
                "Toms Mirror Stash": {
                    art: {
                        1: "    ___  ", 
                        2: "   /o *\ ", 
                        3: "T {* ∞ o}", 
                        4: "O  \* o/ ", 
                        5: "M   ˘˘˘  ", 
                        6: "STASH    "
                    }
                },
                "Tim's D&D Campaigns": {
                    art: {
                        1: "Tims     ", 
                        2: "   _____,", 
                        3: "  / 5e //", 
                        4: " /____// ", 
                        5: "(____(/  ", 
                        6: "   Dreams"
                    }
                },
                "Spirit of the lap": {
                    art: {
                        1: "    __   ",
                        2: " __/  \_ ", 
                        3: "'-0---0-'", 
                        4: "  ╭‼╮aah!", 
                        5: "ꞈ/▐█▌\,  ", 
                        6: " _╱▀╲_   "
                    }
                },
                "Dave's Pinny Money": {
                    art: {
                        1: "║  $$$  ║",
                        2: "║=======║", 
                        3: "║ooo-,,╗║",
                        4: "║    |\║║",
                        5: "║|_  _|║║",
                        6: "╚══╩╩══╩╝",
                    }
                },
                "Machiavellian Mangles": {
                    art: {
                        1: " ,.''.,, ", 
                        2: "( ◣\/◢ ) ", 
                        3: " |  ┺  | ", 
                        4: " \ ▼▼▼ / ", 
                        5: "║ ΔΔΔΔΔ ║", 
                        6: "╚3▒▒▒▒▒Ɛ╝"
                    }
                },
                }
            }
        }